"builtin.module"() ({
  "func.func"() <{function_type = (tensor<10x10xf32>, tensor<10x10xf32>, tensor<10x10xf32>) -> tensor<10x10xf32>, sym_name = "test_matmul_add_fused"}> ({
  ^bb0(%arg0: tensor<10x10xf32>, %arg1: tensor<10x10xf32>, %arg2: tensor<10x10xf32>):
    %0 = "onnx.MatMul"(%arg0, %arg1) : (tensor<10x10xf32>, tensor<10x10xf32>) -> tensor<10x10xf32>
    %1 = "onnx.Add"(%0, %arg2) : (tensor<10x10xf32>, tensor<10x10xf32>) -> tensor<10x10xf32>
    "onnx.Return"(%1) : (tensor<10x10xf32>) -> ()
  }) : () -> ()
}) : () -> ()

