"builtin.module"() ({
  "func.func"() <{function_type = () -> (), sym_name = "gemm"}> ({
    %0 = "util.unfoldable_constant"() <{value = dense<"0x0000000041E8A83B41E8283C625C7D3C41E8A83C5122D33C625CFD3C36CB133D3EE8283D47053E3D4F22533D573F683D5F5C7D3DB43C893D38CB933DBC599E3D40E8A83DC476B33D4805BE3DCB93C83D4F22D33DD3B0DD3D573FE83DDBCDF23D5F5CFD3D72F5033EB43C093EF6830E3E38CB133E7A12193EBC591E3EFDA0233E3FE8283E812F2E3EC376333E05BE383E47053E3E894C433ECB93483E0DDB4D3E4F22533E9169583ED3B05D3E15F8623E573F683E99866D3EDBCD723E1D15783E5F5C7D3ED151813E72F5833E1399863EB43C893E55E08B3EF6838E3E9627913E37CB933ED86E963E7912993E1AB69B3EBB599E3E5CFDA03EFDA0A33E9E44A63E3FE8A83EE08BAB3E812FAE3E22D3B03EC376B33E641AB63E05BEB83EA661BB3E4705BE3EE8A8C03E894CC33E2AF0C53ECB93C83E6C37CB3E0DDBCD3EAE7ED03E4F22D33EF0C5D53E9169D83E320DDB3ED3B0DD3E7454E03E15F8E23EB69BE53E573FE83EF8E2EA3E9986ED3E3A2AF03EDBCDF23E7C71F53E1D15F83EBEB8FA3E5F5CFD3E0000003FD151013FA1A3023F72F5033F4247053F1399063FE3EA073FB33C093F848E0A3F54E00B3F25320D3FF5830E3FC6D50F3F9627113F6779123F37CB133F081D153FD86E163FA9C0173F7912193F4A641A3F1AB61B3FEB071D3FBB591E3F8CAB1F3F5CFD203F2D4F223FFDA0233FCEF2243F9E44263F6F96273F3FE8283F103A2A3FE08B2B3FB1DD2C3F812F2E3F52812F3F22D3303FF324323FC376333F94C8343F641A363F356C373F05BE383FD60F3A3FA6613B3F77B33C3F47053E3F18573F3FE8A8403FB9FA413F894C433F5A9E443F2AF0453FFB41473FCB93483F9CE5493F6C374B3F3D894C3F0DDB4D3FDE2C4F3FAE7E503F7FD0513F4F22533F2074543FF0C5553FC117573F9169583F62BB593F320D5B3F035F5C3FD3B05D3FA4025F3F7454603F45A6613F15F8623FE649643FB69B653F87ED663F573F683F2891693FF8E26A3FC9346C3F99866D3F6AD86E3F3A2A703F0B7C713FDBCD723FAC1F743F7C71753F4DC3763F1D15783FED66793FBEB87A3F8E0A7C3F5F5C7D3F2FAE7E3F0000803F"> : tensor<13x15xf32>}> : () -> tensor<13x15xf32>
    %1 = "util.unfoldable_constant"() <{value = dense<"0x00000000B70FB73BB70F373CCE4B893CBC0FB73CAAD3E43CCC4B093DC52D203DBC0F373DB3F14D3DAAD3643DA1B57B3DCD4B893DC8BC943DC42DA03DBF9EAB3DBB0FB73DB780C23DB3F1CD3DAE62D93DAAD3E43DA644F03DA2B5FB3D4F93033ECC4B093E4A040F3EC8BC143E46751A3EC42D203E42E6253EC09E2B3E3E57313EBB0F373E39C83C3EB780423E3539483EB3F14D3E31AA533EAE62593E2C1B5F3EAAD3643E288C6A3EA644703E24FD753EA2B57B3E10B7803E4F93833E8E6F863ECC4B893E0C288C3E4A048F3E89E0913EC8BC943E0799973E46759A3E85519D3EC42DA03E030AA33E42E6A53E81C2A83EC09EAB3EFE7AAE3E3E57B13E7D33B43EBB0FB73EFAEBB93E39C8BC3E78A4BF3EB780C23EF65CC53E3539C83E7415CB3EB3F1CD3EF2CDD03E31AAD33E6F86D63EAF62D93EED3EDC3E2C1BDF3E6BF7E13EAAD3E43EE9AFE73E288CEA3E6768ED3EA644F03EE520F33E24FDF53E63D9F83EA2B5FB3EE091FE3E10B7003F2F25023F4F93033F6E01053F8E6F063FADDD073FCD4B093FECB90A3F0B280C3F2B960D3F4A040F3F6A72103F89E0113FA94E133FC8BC143FE82A163F0799173F2707193F46751A3F66E31B3F85511D3FA4BF1E3FC42D203FE39B213F030A233F2278243F42E6253F6154273F81C2283FA0302A3FC09E2B3FDF0C2D3FFF7A2E3F1EE92F3F3D57313F5DC5323F7C33343F9CA1353FBB0F373FDB7D383FFAEB393F1A5A3B3F39C83C3F59363E3F78A43F3F9812413FB780423FD7EE433FF65C453F15CB463F3539483F54A7493F74154B3F93834C3FB3F14D3FD25F4F3FF2CD503F113C523F31AA533F5018553F7086563F8FF4573FAE62593FCED05A3FED3E5C3F0DAD5D3F2C1B5F3F4C89603F6BF7613F8B65633FAAD3643FCA41663FE9AF673F091E693F288C6A3F48FA6B3F67686D3F86D66E3FA644703FC5B2713FE520733F048F743F24FD753F436B773F63D9783F82477A3FA2B57B3FC1237D3FE1917E3F0000803F"> : tensor<15x12xf32>}> : () -> tensor<15x12xf32>
    %2 = "stablehlo.dot"(%0, %1) : (tensor<13x15xf32>, tensor<15x12xf32>) -> tensor<13x12xf32>
    "check.expect_almost_eq_const"(%2) <{atol = 9.99999974E-5 : f32, rtol = 0.000000e+00 : f32, value = dense<"0xF594B33E4721B53E98ADB63EEA39B83E3CC6B93E8D52BB3EDFDEBC3E306BBE3E82F7BF3ED483C13E2510C33E779CC43E271F653FF18D673FBAFC693F836B6C3F4DDA6E3F1649713FDFB7733FA926763F7295783F3B047B3F05737D3FCEE17F3FEA39B83F9F45BA3F5451BC3F095DBE3FBE68C03F7374C23F2880C43FDD8BC63F9297C83F46A3CA3FFBAECC3FB0BACE3F40E4FD3F2362004025D20140284203402BB204402D220640309207403202094035720A4038E20B403A520D403DC20E404BC7214076A12340A17B2540CC552740F62F2940210A2B404CE42C4077BE2E40A1983040CC723240F74C344021273640779C4440C9E046401C2549406F694B40C2AD4D4015F24F4068365240BB7A54400DBF564060035940B3475B40068C5D40A27167401D206A4098CE6C40137D6F408E2B724009DA744084887740FF367A407AE57C40F5937F40382181407578824066238540B8AF86400A3C88405BC88940AD548B40FEE08C40506D8E40A1F98F40F385914045129340969E9440E82A9640FC8D9640624F9840C7109A402DD29B4093939D40F8549F405E16A140C3D7A2402999A4408F5AA640F41BA8405ADDA94092F8A7400BEFA94085E5AB40FFDBAD4078D2AF40F2C8B1406CBFB340E6B5B5405FACB740D9A2B9405399BB40CC8FBD402763B940B58EBB4043BABD40D1E5BF405E11C240EC3CC4407A68C6400894C84095BFCA4023EBCC40B116CF403F42D140BDCDCA405F2ECD40018FCF40A2EFD1404450D440E6B0D6408811D9402A72DB40CBD2DD406D33E0400F94E240B1F4E4405238DC4008CEDE40BE63E14074F9E3402A8FE640E024E94096BAEB404C50EE4002E6F040B87BF3406D11F64023A7F840"> : tensor<13x12xf32>}> : (tensor<13x12xf32>) -> ()
    "func.return"() : () -> ()
  }) : () -> ()
}) : () -> ()

